mydb> help
DBAPpend:      append a row or column of data to the table
DBAVerage:     compute the average of a column
DBCount:       report the distinct count of data in a column
DBDelete:      delete a row or column from the table
DBMAx:         report the maximum number of a column
DBMIn:         report the minimum number of a column
DBPrint:       print the data in the table
DBRead:        read data from .csv file
DBSort:        sort the data in the table
DBSUm:         compute the summation of a column
DOfile:        execute the commands in the dofile
HELp:          print this help message
HIStory:       print command history
Quit:          quit the execution


mydb> do t

mydb> do do2

mydb> do do1

mydb> dbr ../tests/test2.csv
"../tests/test2.csv" was read in successfully.

mydb> dbp -t
     7     2     5     5     8     .
     3     .     6     7     .    10
     5     6     .     4     9     0
     .     8     4     .     7     .
     7     .     5     9     .     1
     8     .     3     0     4     1
     .     4     4     4     .     4


mydb> dbap -r 3 -

mydb> dbap -c 7 3 4 - 1

mydb> dbp -t
     7     2     5     5     8     .     7
     3     .     6     7     .    10     3
     5     6     .     4     9     0     4
     .     8     4     .     7     .     .
     7     .     5     9     .     1     1
     8     .     3     0     4     1     .
     .     4     4     4     .     4     .
     3     .     .     .     .     .     .


mydb> dbp 3 2
4

mydb> dbp 3 1
8

mydb> dbp 3 4
7

mydb> dbp -r 0
7 2 5 5 8 . 7

mydb> dbp -c 2
5 6 . 4 5 3 4 .

mydb> dbav 1
The average of column 1 is 5.00.

mydb> dbc 0
The distinct count of column 0 is 4.

mydb> dbd -r 3

mydb> dbp -t
     7     2     5     5     8     .     7
     3     .     6     7     .    10     3
     5     6     .     4     9     0     4
     7     .     5     9     .     1     1
     8     .     3     0     4     1     .
     .     4     4     4     .     4     .
     3     .     .     .     .     .     .


mydb> dbap -c 4 3 5 1

mydb> dbp -t
     7     2     5     5     8     .     7     4
     3     .     6     7     .    10     3     3
     5     6     .     4     9     0     4     5
     7     .     5     9     .     1     1     1
     8     .     3     0     4     1     .     .
     .     4     4     4     .     4     .     .
     3     .     .     .     .     .     .     .


mydb> dbp -s
(#rows, #cols, #data) = (7, 8, 36)

mydb> dbd -c 1

mydb> dbp -t
     7     5     5     8     .     7     4
     3     6     7     .    10     3     3
     5     .     4     9     0     4     5
     7     5     9     .     1     1     1
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .
     3     .     .     .     .     .     .


mydb> dbma 0
The max data of column 0 is 8.

mydb> dbmi 1
The min data of column 1 is 3.

mydb> dbsort 0 1 2

mydb> dbp -t
     3     6     7     .    10     3     3
     3     .     .     .     .     .     .
     5     .     4     9     0     4     5
     7     5     5     8     .     7     4
     7     5     9     .     1     1     1
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .


mydb> dbsort 1

mydb> dbp -t
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .
     7     5     5     8     .     7     4
     7     5     9     .     1     1     1
     3     6     7     .    10     3     3
     3     .     .     .     .     .     .
     5     .     4     9     0     4     5


mydb> dbsort 2

mydb> dbp -t
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .
     5     .     4     9     0     4     5
     7     5     5     8     .     7     4
     3     6     7     .    10     3     3
     7     5     9     .     1     1     1
     3     .     .     .     .     .     .


mydb> dbsum 2
The sum of column 2 is 29.

mydb> dbp -s
(#rows, #cols, #data) = (7, 7, 33)

mydb> dbapp -col -

mydb> dbp -t
     8     3     0     4     1     .     .     .
     .     4     4     .     4     .     .     .
     5     .     4     9     0     4     5     .
     7     5     5     8     .     7     4     .
     3     6     7     .    10     3     3     .
     7     5     9     .     1     1     1     .
     3     .     .     .     .     .     .     .


mydb> dbmax 2
The max data of column 2 is 9.

mydb> dbmin 2
The min data of column 2 is 0.

mydb> dbsum 2
The sum of column 2 is 29.

mydb> dbcount 2
The distinct count of column 2 is 5.

mydb> dbave 2
The average of column 2 is 4.83.

mydb> dbmax 3
The max data of column 3 is 9.

mydb> dbmin 3
The min data of column 3 is 4.

mydb> dbsum 3
The sum of column 3 is 21.

mydb> dbcount 3
The distinct count of column 3 is 3.

mydb> dbave 3
The average of column 3 is 7.00.

mydb> dbp 3 3
8

mydb> 
mydb> 
mydb> his
   0: help
   1: do t
   2: do do2
   3: do do1
   4: dbr ../tests/test2.csv
   5: dbp -t
   6: dbap -r 3 -
   7: dbap -c 7 3 4 - 1
   8: dbp -t
   9: dbp 3 2
   10: dbp 3 1
   11: dbp 3 4
   12: dbp -r 0
   13: dbp -c 2
   14: dbav 1
   15: dbc 0
   16: dbd -r 3
   17: dbp -t
   18: dbap -c 4 3 5 1
   19: dbp -t
   20: dbp -s
   21: dbd -c 1
   22: dbp -t
   23: dbma 0
   24: dbmi 1
   25: dbsort 0 1 2
   26: dbp -t
   27: dbsort 1
   28: dbp -t
   29: dbsort 2
   30: dbp -t
   31: dbsum 2
   32: dbp -s
   33: dbapp -col -
   34: dbp -t
   35: dbmax 2
   36: dbmin 2
   37: dbsum 2
   38: dbcount 2
   39: dbave 2
   40: dbmax 3
   41: dbmin 3
   42: dbsum 3
   43: dbcount 3
   44: dbave 3
   45: dbp 3 3
   46: his

mydb> 
mydb> 