mydb> do do1

mydb> dbr ../tests/test2.csv

mydb> dbp -t
     7     2     5     5     8     .
     3     .     6     7     .    10
     5     6     .     4     9     0
     .     8     4     .     7     .
     7     .     5     9     .     1
     8     .     3     0     4     1
     .     4     4     4     .     4


mydb> dbap -r 3 -

mydb> dbap -c 7 3 4 - 1

mydb> dbp -t
     7     2     5     5     8     .     7
     3     .     6     7     .    10     3
     5     6     .     4     9     0     4
     .     8     4     .     7     .     .
     7     .     5     9     .     1     1
     8     .     3     0     4     1     .
     .     4     4     4     .     4     .
     3     .     .     .     .     .     .


mydb> dbp 3 2
4

mydb> dbp 3 1
8

mydb> dbp 3 4
7

mydb> dbp -r 0
7 2 5 5 8 . 7

mydb> dbp -c 2
5 6 . 4 5 3 4 .

mydb> dbav 1
The average of column 1 is 5.00.

mydb> dbc 0
The distinct count of column 0 is 4.

mydb> dbd -r 3

mydb> dbp -t
     7     2     5     5     8     .     7
     3     .     6     7     .    10     3
     5     6     .     4     9     0     4
     7     .     5     9     .     1     1
     8     .     3     0     4     1     .
     .     4     4     4     .     4     .
     3     .     .     .     .     .     .


mydb> dbap -c 4 3 5 1

mydb> dbp -t
     7     2     5     5     8     .     7     4
     3     .     6     7     .    10     3     3
     5     6     .     4     9     0     4     5
     7     .     5     9     .     1     1     1
     8     .     3     0     4     1     .     .
     .     4     4     4     .     4     .     .
     3     .     .     .     .     .     .     .


mydb> dbp -s
(#rows, #cols, #data) = (7, 8, 36)

mydb> dbd -c 1

mydb> dbp -t
     7     5     5     8     .     7     4
     3     6     7     .    10     3     3
     5     .     4     9     0     4     5
     7     5     9     .     1     1     1
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .
     3     .     .     .     .     .     .


mydb> dbma 0
The max data of column 0 is 8.

mydb> dbmi 1
The min data of column 1 is 3.

mydb> dbsort 0 1 2

mydb> dbp -t
     3     6     7     .    10     3     3
     3     .     .     .     .     .     .
     5     .     4     9     0     4     5
     7     5     5     8     .     7     4
     7     5     9     .     1     1     1
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .


mydb> dbsort 1

mydb> dbp -t
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .
     7     5     5     8     .     7     4
     7     5     9     .     1     1     1
     3     6     7     .    10     3     3
     3     .     .     .     .     .     .
     5     .     4     9     0     4     5


mydb> dbsort 2

mydb> dbp -t
     8     3     0     4     1     .     .
     .     4     4     .     4     .     .
     5     .     4     9     0     4     5
     7     5     5     8     .     7     4
     3     6     7     .    10     3     3
     7     5     9     .     1     1     1
     3     .     .     .     .     .     .


mydb> dbsum 2
The sum of column 2 is 29.

mydb> dbp -s
(#rows, #cols, #data) = (7, 7, 33)

mydb> dbapp -col -

mydb> dbp -t
     8     3     0     4     1     .     .     .
     .     4     4     .     4     .     .     .
     5     .     4     9     0     4     5     .
     7     5     5     8     .     7     4     .
     3     6     7     .    10     3     3     .
     7     5     9     .     1     1     1     .
     3     .     .     .     .     .     .     .


mydb> dbmax 2
The max data of column 2 is 9.

mydb> dbmin 2
The min data of column 2 is 0.

mydb> dbsum 2
The sum of column 2 is 29.

mydb> dbcount 2
The distinct count of column 2 is 5.

mydb> dbave 2
The average of column 2 is 4.83.

mydb> dbmax 3
The max data of column 3 is 9.

mydb> dbmin 3
The min data of column 3 is 4.

mydb> dbsum 3
The sum of column 3 is 21.

mydb> dbcount 3
The distinct count of column 3 is 3.

mydb> dbave 3
The average of column 3 is 7.00.

mydb> dbp 3 3
8

mydb> 
mydb> 
mydb> 